<?php

    return [
        'lesson_added' => 'Данные нового занятия ? добавлены.',
        'lesson_removed' => 'Данные занятия ? удалены.',
        'lesson_not_found' => 'Такое занятие не найдено.',
        'lesson_updated' => 'Данные занятия ? обновлены.',
        'schedule_validation_error' => 'Ошибка валидации входящих данных для получения расписания.',
        'is_teacher_lesson_dublicate' => 'На указанное время (?-1, ?-2 пара ?-3) для преподавателя ?-4 назначено несколько занятий.',
        'is_group_lesson_dublicate' => 'На указанное время (?-1, ?-2 пара, ?-3) для группы ?-4 назначено несколько занятий.',
    ];