<?php

return [
    'faculty_department_discrepancy' => 'Несоответствие факультета и кафедры!',
    'faculty_study_program_discrepancy' => 'Несоответсвие факультета и учебной программы',
    'study_degree_study_program_discrepancy' => 'Несоответствие между уровем образования и учебной программой!',
    'study_program_study_orientation_discrepancy' => 'Несоответсвие между учебной программой и специальностью!',
    'group_is_occupied' => 'Выбранная группа(ы) уже занята в укуазанном месте расписания!',
    'teacher_is_occupied' => 'Выбранный преподаватель уже занят в укуазанном месте расписания!',
    'room_is_occupied' => 'Выбранная учебная аудитория уже занята в указанном месте расписания!',
    'array_is_empty' => 'Массив :attribute не может быть пустым.',
    'invalid_input_data' => 'Входные данные не соответствуют требованиям. Пожалуйста, свяжитесь с администратором.',
    'permission_error' => 'У вас нет прав доступа к этому разделу.',
    'not_time_for_replacement_request_process' => 'Недостаточно времени для обработки запроса на замену.',
    'request_already_exists' => 'Такой запрос уже создан.',
    'lesson_is_in_replacement_already' => 'Одно из привлекаемых к замене занятий уже задействовано в другой замене',
    'failed_week_number' => 'Выбранная неделя не соответствует текущему учебному семестру',
];
